CEKAJ:	   IN 0B	// Се вчитува податокот од порта 0Bh
	   CPI 09	// Се споредува со 09h
	   JNZ CEKAJ	// Се чека да дојде податок 09h
		// Се полни HL парот со адресата на полето
	   DCR D
	
		// Бројач на податоци (не повеќе од 255)
	   OUT 0A
	   CALL PRATI	// се повикува процедура за праќање
	   INX H	// наредната адреса во полето
	   DCR D	// еден податок е пратен
		// ако не се испратени сите врати се отпочеток
	
	   SIM
	   MVI A,0C	// откако ќе се испратат стави вредност OCh во акумулаторот
	   OUT 0A	// таа вредност се испраќа на адреса 0Аh
		// Крај на програмата

DOCNI:		// процедура за доцнење 833µs

LOOP:		// 4 такта
	   JNZ LOOP	// 10 такта
	   RET	// 14 такта * 0,5 µs = 7 µs * 119 = 833 µs

PRATI:	   MVI C,08	// Треба да се праќа бит по бит

CIKL:	   MOV B,A	// Привремена копија и во B регистарот
		// Го поставуваме битот 6 на 1, останатите не ги менуваме
